print('''Інструкція! В цій грі ти будеш мати можливість вирішувати долю простого (на перший погляд) хлопчика, що призведе до різних кінцівок. Можете записувати скільки ви кінцівок знайшли. Хев фан!


''')
print('''Ця історія про одного простого на перший погляд хлопчика, якого життя занесло у дуже веселу пригоду...

                                                       ''')
print('''                       Акт перший: шлях до школи...''')
print("*Дзвенить будильник*")
print('''Світогор: Добрий ранок, світе. *Взяв телефон до рук* 
Світогор: Що?! Сьогодні понеділок?! Ох чорт забирай! Cьогодні школа!..

''')
name = "Світогор"  # Савко Світогор Романович
print(
    '''І так починається ранок одного з багатьох персонажів цієї захоплюючої історії, але ми цього разу розкажемо лише про одного з них...''')
act1 = input('''Що будемо робити? (Можна "Збиратися" або "Продовжити сон")''')
while act1 != "Збиратися" and act1 != "збиратися" and act1 != "Продовжити сон" and act1 != "продовжити сон":
    act1 = input("Не зрозумів, повторіть")
if act1 == "Збиратися" or act1 == "збиратися":
    print('''Що ж, наш герой вирішив збиратися до школи. Перший крок до розкриття нашої цікавої загадки!

    ''')
    print(
        '''Дорогою до школи наш Світогор зустрічається з безхатньою собачкою яка всім своїм виглядом просить поїсти''')
    act2 = input('''Що будемо робити? (Можна "Нагодувати", або "Не годувати" собачку)''')
    while act2 != "Нагодувати" and act2 != "нагодувати" and act2 != "Не годувати" and act2 != "не годувати собачку":
        act2 = input("Не зрозумів, повторіть")
    if act2 == "Нагодувати" or act2 == "нагодувати":
        print('''Світогор: Тримай, песику, пам'ятай моє добре серце!)
Так наш герой позбувся шкільного обіду, але ощасливив живе створіння, що вже багато! Можливо, цей пес нам врятує життя)...

        ''')
        print('''Пройшовши тернистий шлях від свого будинку до школи, наш герой все ж досягнув своєї цілі...

        ''')
        print('''                      Акт другий: Школа міста Старий Ліс...''')
        print('''Перші два уроки пройшли беззслідно і нудно, пора йти до їдальні!
 У їдальні подають страву вічну, як світ і по історії, і по вигляду... гречка з котлетою.
 Наш герой може з'їсти цю порцію, або об'явити голодування.''')
        act3 = input('''Що будемо робити? (Можна "З'їсти" порцію, або "Голодувати")''')
        while act3 != "З'їсти" and act3 != "з'їсти" and act3 != "Голодувати" and act3 != "голодувати":
            act3 = input("Не зрозумів, повторіть")
        if act3 == "Голодувати" or act3 == "голодувати":
            print('''Світогор: Я вже краще помру з голоду, аніж буду їсти порцію - подумав наш герой собі.

Цього разу ти затримався в їдальні. Ти дуже довго дивився на нову дівчину в школі, але тобі здавалося що це було лише пару секунд, тому з їдальні ти виходив останнім.
Поки ти повертався до класу ти почув одну дуже дивну розмову. Голос здавався тобі схожим на голос директора школи та вчителя фізкультури.''')
            act4 = input('''Підслухати розмову чи ні? ("Так" або "Ні")''')
            while act4 != "Так" and act4 != "так" and act4 != "Ні" and act4 != "ні":
                input("Я вас не зрозумів, повторіть запит")
            if act4 == "Так" or act4 == "так":
                print('''Директор: коротше, пішло воно все *****, ти замінував?
Вчитель фізкультури: Так, замінував, треба звідси бігти.
Почувши цю розмову Світогор зрозумів, що забув написати домашню роботу, а ще зрозумів те що вчителі замінували школу і збираються її підірвати!
Просити допомоги у інших вчителів було небезпечно. Хто знає, хто ще в цьому замішаний?
Просити допомоги в учнів сенсу не було, ніхто йому не повірить.
Діяти приходиться самотужки. Потрібен був план та інструменти...''')
                print('''                   Фінальний акт: Або пан, або пропав...''')
                print('''Світогор: Наскільки я зрозумів, бомбу вони заклали в кабінеті хімії, в підвалі. Тепер треба якось пробратися до того підвалу.
На лазі в підвал висить дебелий сталевий замок. Якби ти поїв, можливо тобі б вистачило сили розламати цей замок, але тобі просто невистачає сили його розламати. Невже це кінець?...


Ось раптом через двері забігає собачка яку ти сьогодні годував і в пащі тримає якийсь пакетик. Це терміт. На записці разом з ним пише: "Хлопче, ти мене не знаєш, але я знаю що ти хочеш зробити, тому я тобі допоможу. Постав цей пакетик на замок, прикрий очі, і підпали його, це розплавить замок."
Ти успішно пропалив замок і потрапив до підвалу.''')
                print('''У підвалі тебе зустрічає бомба і цікавий та непримітний сейф''')
                act5 = input(
                    '''Розмінувати бомбу чи спробувати відкрити сейф? (Можна "Розмінувати" або "Відкрити сейф" (Треба знати пароль))''')
                while act5 != "Розмінувати" and act5 != "розмінувати" and act5 != "Відкрити сейф" and act5 != "відкрити сейф":
                    act5 = input("Я вас не зрозумів, повторіть")
                if act5 == "Розмінувати" or act5 == "розмінувати":
                    print(
                        '''Благополучно розмінувавши бомбу, головний герой закінчив цю історію, сповнену драми, непорозумінь, сліз та любові... (Хороша кінцівка!)''')
                elif act5 == "Відкрити сейф" or act5 == "відкрити сейф":
                    password = "24081991"
                    passwd = "0"
                    while passwd != password:
                        passwd = input("Введіть пароль: ")
                    print('''У сейфі ти знаходиш документи. Як виявляється, це замінування спонсорувалося урядом росії, а директор - російський шпигун.
Світогор: Це багато пояснює... - сказав наш герой, і втік звідти, знищивши перед тим бомбу.
Ти переміг. Вітаю! (Істинна кінцівка!)''')
            elif act4 == "Ні" or act4 == "ні":
                print(
                    '''Світогор: Та ну його, я що, не вихований? - сказав собі наш герой. І з одного боку він правий, а з іншого цей вчинок призвів до катастрофічних наслідків. Всі померли. Кінець. (Третя кінцівка!)''')
        elif act3 == "З'їсти" or act3 == "з'їсти":
            print('''Ти так сильно їв ту порцію, ніби ти з голодного краю прилетів сюди просто щоби поїсти. 
Очевидно що така їжа негативно вплинула на твоє здоров'я. Тебе знайшли в шкільному туалеті, без пульсу... (Друга кінцівка!)''')
    elif act2 == "Не годувати" or act2 == "не годувати":
        print('''Світогор: Слухай, я теж живий, і теж хочу їсти, тому вибачай але ділитися я не буду.
        Так наш герой не позбувся свого шкільного обіду, але сповна можливо що це була остання можливість врятувати цього пса, і від сьогодні його буде гризти совість через його скупість...

        ''')
        print('''Пройшовши тернистий шлях від свого будинку до школи, наш герой все ж досягнув своєї цілі...

        ''')
        print('''                      Акт другий: Школа міста Старий Ліс...''')
        print('''Перші два уроки пройшли беззслідно і нудно, пора йти до їдальні!
У їдальні подають класичні помиї, але ж ти не віддав собаці свій обід, тому шкодити своєму здоров'ю не прийдеться
Світогор: Шкода мені тих дітей, які мусять це їсти...''')
        print('''Цього разу ти затримався в їдальні. Ти дуже довго дивився на нову дівчину в школі, але тобі здавалося що це було лише пару секунд, тому з їдальні ти виходив останнім.
Поки ти повертався до класу ти почув одну дуже дивну розмову. Голос здавався тобі схожим на голос директора школи та вчителя фізкультури.''')
        act4 = input('''Підслухати розмову чи ні? ("Так" або "Ні")''')
        while act4 != "Так" and act4 != "так" and act4 != "Ні" and act4 != "ні":
            input("Я вас не зрозумів, повторіть запит")
        if act4 == "Так" or act4 == "так":
            print('''Директор: коротше, пішло воно все *****, ти замінував?
Вчитель фізкультури: Так, замінував, треба звідси бігти.
Почувши цю розмову Світогор зрозумів, що забув написати домашню роботу, а ще зрозумів те що вчителі замінували школу і збираються її підірвати!
Просити допомоги у інших вчителів було небезпечно. Хто знає, хто ще в цьому замішаний?
Просити допомоги в учнів сенсу не було, ніхто йому не повірить.
Діяти приходиться самотужки. Потрібен був план та інструменти...''')
            print('''                   Фінальний акт: Або пан, або пропав...''')
            print('''Світогор: Наскільки я зрозумів, бомбу вони заклали в кабінеті хімії, в підвалі. Тепер треба якось пробратися до того підвалу.
На лазі в підвал висить дебелий сталевий замок. Через те що ти поїв, ти одним чітким ударом лому збиваєш замок і спускаєшся в підвал... 

''')
            print('''У підвалі тебе зустрічає бомба і цікавий та непримітний сейф''')
            act5 = input(
                '''Розмінувати бомбу чи спробувати відкрити сейф? (Можна "Розмінувати" або "Відкрити сейф" (Треба знати пароль))''')
            while act5 != "Розмінувати" and act5 != "розмінувати" and act5 != "Відкрити сейф" and act5 != "відкрити сейф":
                act5 = input("Я вас не зрозумів, повторіть")
            if act5 == "Розмінувати" or act5 == "розмінувати":
                print(
                    '''Благополучно розмінувавши бомбу, головний герой закінчив цю історію, сповнену драми, непорозумінь, сліз та любові... (Хороша кінцівка!)''')
            elif act5 == "Відкрити сейф" or act5 == "відкрити сейф":
                password = "24081991"
                passwd = "0"
                while passwd != password:
                    passwd = input("Введіть пароль: ")
                print('''У сейфі ти знаходиш документи. Як виявляється, це замінування спонсорувалося урядом росії, а директор - російський шпигун.
Світогор: Це багато пояснює... - сказав наш герой, і втік звідти, знищивши перед тим бомбу.
Ти переміг. Вітаю! (Істинна кінцівка!)''')
        elif act4 == "Ні" or act4 == "ні":
            print(
                '''Світогор: Та ну його, я що, не вихований? - сказав собі наш герой. І з одного боку він правий, а з іншого цей вчинок призвів до катастрофічних наслідків. Всі померли. Кінець. (Третя кінцівка!)''')
elif act1 == "Продовжити сон" or act1 == "продовжити сон":
    print('''Світогор: Та пішло воно все. 
    Наш герой вирішив не вставати з ліжка, а повернутися до королівства снів. Ну що ж, твоя безвідповідальність призвела до безповоротних наслідків. Всі померли, але перед тим йому приснився дивний сон, про свободу, про незалежність. Кінець. (Перша кінцівка!)''')